<a href="https://colab.research.google.com/github/Kimtaeheon95/ds-admission-challenge/blob/master/%EA%B9%80%ED%83%9C%ED%97%8Cds_bootcamp_admission_challenge_ipynb%EC%9D%98_%EC%82%AC%EB%B3%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Challenge

- 코드스테이츠 DS 부트캠프 어드미션을 위한 Challenge 과제 입니다. 
- 아래 challenge 를 풀기 위해 제공된 강의가 모든 것을 알려주진 않습니다. 
- 따라서 필요한 부분은 스스로 google 검색을 통해 이 challenge 를 완성해 주셔야 합니다. 
- 각 shell 에 필요한 부분을 작성하신 후 함께 링크를 제출해 주시면 됩니다.
- 모든 결과물은 하나의 shell에서 모두 실행될 수 있도록 print문을 사용해 주세요. run all 했을 때 전체 shell 이 모두 잘 실행될 수 있도록 관리해 주세요.

In [ ]:
# 1. 다음의 list 에서 두 번째 list elemnet 를 print 해 보세요
list_01 = ['Paul', 'John', 'Ringo', 'George']

print(list_01[1])

John

In [ ]:
# 2. 다음의 list in the list에서 두 번째 element 를 print 해 보세요
list_02 = [['Paul', 'John', 'Ringo', 'George']]

list_02[0] [1]

'John'

In [49]:
# Initializing list  
list_01 = [ 1, 6, 3, 5, 3, 4 ] 
list_02 = [ 1, 6, 3, 5, 3 ] 

# for loop을 이용하여 두 개의 리스트 안에 4가 있는지 없는지 print 하는 코드를 작성하세요
count = 0
for i in list_01 :
  if i == 4 : count = 1
if(count == 1) : print("list_01 :", ("4가 있어요"))
else : print("list_01 :",("없어요"))

count = 0
for i in list_02 :
  if i == 4 : count = 1
if(count == 1) : print("list_02 :", ("4가 있어요"))
else : print("list_02 :", ("없어요"))

list_01 : 4가 있어요
list_02 : 없어요

In [51]:
# 위 코드 역할을 하는 함수를 작성해 보세요
def fn_name(list_in) :
  count = 0
  for i in list_in :
    if i == 4 : count = 1

  if(count == 1) : print("4가 있어요")
  else : print("없어요")


fn_name(list_01)
fn_name(list_02)
#def fn_name(list_in):
 # for mylist in list_in:
  #  print('element:', mylist)
  #if mylist == 4:
   # print('4를 발견했습니다.')
 # else:
  #    print('4가 없습니다.')

  
#(fn_name(list_01))
#print(" ")
#(fn_name(list_02))

4가 있어요
없어요

In [ ]:
list_03 = [4, 5, 8, 9, 10] 
# 위 list element 중 8보다 큰 숫자가 몇 개가 있는지 코드로 작성해 보세요. 

len([i for i in list_03 if i > 8])

2

In [52]:
# BMI
height = [1.87,  1.87, 1.82, 1.91, 1.90, 1.85]
weight = [81.65, 97.52, 95.25, 92.98, 86.18, 88.45]

# bmi = weight / height ** 2 를 numpy array 활용하여 구해보세요

# bmi 가 24 이상인 값들만 선택해 보세요
import numpy as np

np_h = np.array(height)
np_w = np.array(weight)

bmi = np_w / np_h ** 2

bmi_01 = bmi > 24
bmi[bmi_01]

array([27.88755755, 28.75558507, 25.48723993, 25.84368152])

In [55]:
# pandas 패키지 라이브러리를 불러오세요
import pandas as pd
# 아래 내용을 담는 pandas Dataframe 을 생성하세요
# {'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']}
lines = {'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']}

brics = pd.DataFrame(lines, index = ["1", "2"])
brics

             Bob           Sue
1    I liked it.  Pretty good.
2  It was awful.        Bland.

In [ ]:
# 아래와 같은 dataframe을 만들어 보세요. (참고: 연도가 index가 되게 해 주세요)
"""
year dept     revenue
2015 Sales    30
2016 Sales    35
2017 Sales    40
"""

# 2017년 데이터만 선택해 보세요

# 조건(condition)을 활용하여 revenue 30 이상으로만 filter 해 보세요. reference: https://pandas.pydata.org/pandas-docs/stable/getting_started/intro_tutorials/03_subset_data.html 
df = {'year': [2014, 2015, 2016, 2017],
      'dept':['Sales' ,'Sales', 'Sales', 'Sales'],
      'revenue':[25,30, 35, 40]}

import pandas as pd
brics = pd.DataFrame(df)
print(brics)
brics.iloc[3]




y_30 = brics[brics['revenue']>=30]
y_30.head()

   year   dept  revenue
0  2014  Sales       25
1  2015  Sales       30
2  2016  Sales       35
3  2017  Sales       40

   year   dept  revenue
1  2015  Sales       30
2  2016  Sales       35
3  2017  Sales       40

In [ ]:
brics.iloc[3]

year        2017
dept       Sales
revenue       40
Name: 3, dtype: object

In [57]:
# 'https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv' 자료를 불러와 dataframe으로 만들어 보세요

#df = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')
#print(df)

df = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')
print(df.head())
print(df.tail())

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833
2         1       3  ...                       0   7.9250
3         1       1  ...                       0  53.1000
4         0       3  ...                       0   8.0500

[5 rows x 8 columns]
     Survived  Pclass  ... Parents/Children Aboard   Fare
882         0       2  ...                       0  13.00
883         1       1  ...                       0  30.00
884         0       3  ...                       2  23.45
885         1       1  ...                       0  30.00
886         0       3  ...                       0   7.75

[5 rows x 8 columns]

In [58]:
# 타이타닉 데이터의 shape은 어떻게 되나요? 



# 생존자 데이터 중 여자, 남자 중 누가 더 많나요? 참고: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html

#df = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')

df.shape

(887, 8)

In [ ]:
# 타이타닉 row record에서 10~20번째 줄을 출력해 보세요

print(df[10:21])

    Survived  Pclass  ... Parents/Children Aboard     Fare
10         1       3  ...                       1  16.7000
11         1       1  ...                       0  26.5500
12         0       3  ...                       0   8.0500
13         0       3  ...                       5  31.2750
14         0       3  ...                       0   7.8542
15         1       2  ...                       0  16.0000
16         0       3  ...                       1  29.1250
17         1       2  ...                       0  13.0000
18         0       3  ...                       0  18.0000
19         1       3  ...                       0   7.2250
20         0       2  ...                       0  26.0000

[11 rows x 8 columns]

In [64]:
# 타이타닉 데이터에서 'Survived', 'Age', 'Sex' 칼럼 데이터를 선택해 보세요

#df[['Survived', 'Age', 'Sex']]

print(df[['Survived', 'Age', 'Sex']].head())

   Survived   Age     Sex
0         0  22.0    male
1         1  38.0  female
2         1  26.0  female
3         1  35.0  female
4         0  35.0    male

In [65]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [81]:
# 타이타닉 데이터에서 생존자 데이터만 골라보세요

result = train[(train['Survived'] == 1)]
print(result.shape)
result.head()
#row가 342

(342, 12)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

In [22]:
#생존자 데이터 중 여자, 남자 중 누가 더 많나요?

result_female = train[(train['Sex'] == 'female')]
print('여성 : ', len(result_female))

result_male = train[(train['Sex'] == 'male')]
print('남성 : ', len(result_male))
#생존자만 추려낸 데이터가 아닌 단지 'Sex' 데이터의 성별만 추려낸것..row가 342이기때문에 말이 안됨.

여성 :  314
남성 :  577

In [70]:
surv = train[train["Survived"] == 1]

surv["Sex"].value_counts()
#이게 진짜.233 + 109 = 342 따라서 여자의 수가 더 많다.

female    233
male      109
Name: Sex, dtype: int64